tap "homebrew/bundle"
tap "homebrew/services"
# Fast, highly customisable system info script
brew "neofetch"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
vscode "adrien.visualstudiodarktheme"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "ashwingopalsamy.macos-dark-theme"
vscode "batisteo.vscode-django"
vscode "burkeholland.simple-react-snippets"
vscode "clemenspeters.format-json"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "hsnazar.hyper-term-theme"
vscode "hyesun.py-paste-indent"
vscode "jaromirroth.mirage-dark-plus"
vscode "kevinrose.vsc-python-indent"
vscode "kiranshah.chatgpt-helper"
vscode "magicstack.magicpython"
vscode "marqu3s.aurora-x"
vscode "mgmcdermott.vscode-language-babel"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "okon3.ayu-miragemod"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rubiin.nestjs"
vscode "sallar.vscode-duotone-dark"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "teabyii.ayu"
vscode "that70schris.arcade"
vscode "thehedgefrog.blue-whale"
vscode "uloco.theme-bluloco-dark"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xabikos.javascriptsnippets"
vscode "yy0931.vscode-sqlite3-editor"
vscode "zrnatoneto.dark-green"
